# Chapter 6: How to clean the data

In [29]:
import pandas as pd

## What the info() method can tell you

In [30]:
polls = pd.read_csv('../data/president_polls_2016.csv')

In [31]:
polls.info(verbose=True, memory_usage='deep', show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12624 entries, 0 to 12623
Data columns (total 27 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   cycle             12624 non-null  int64
 1   branch            12624 non-null  object
 2   type              12624 non-null  object
 3   matchup           12624 non-null  object
 4   forecastdate      12624 non-null  object
 5   state             12624 non-null  object
 6   startdate         12624 non-null  object
 7   enddate           12624 non-null  object
 8   pollster          12624 non-null  object
 9   grade             11337 non-null  object
 10  samplesize        12621 non-null  float64
 11  population        12624 non-null  object
 12  poll_wt           12624 non-null  float64
 13  rawpoll_clinton   12624 non-null  float64
 14  rawpoll_trump     12624 non-null  float64
 15  rawpoll_johnson   8397 non-null   float64
 16  rawpoll_mcmullin  90 non-null     float64
 17  adjpoll_clinton   12624 non-null  float64
 18  adjpoll_trump     12624 non-null  float64
 19  adjpoll_johnson   8397 non-null   float64
 20  adjpoll_mcmullin  90 non-null     float64
 21  multiversions     36 non-null     object
 22  url               12621 non-null  object
 23  poll_id           12624 non-null  int64
 24  question_id       12624 non-null  int64
 25  createddate       12624 non-null  object
 26  timestamp         12624 non-null  object
dtypes: float64(10), int64(3), object(14)
memory usage: 12.9 MB

In [32]:
# NOTE: This may take a long time to run
import time
start = time.process_time()
jobs = pd.read_excel("../data/oesm18all/all_data_M_2018.xlsx") 
print("--- %s seconds ---" % (time.time() - start))

--- 1634671465.7511885 seconds ---

In [33]:
jobs.info(verbose=True, memory_usage='deep', show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 403895 entries, 0 to 403894
Data columns (total 31 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   area          403895 non-null  int64
 1   area_title    403895 non-null  object
 2   area_type     403895 non-null  int64
 3   naics         403895 non-null  object
 4   naics_title   403895 non-null  object
 5   i_group       403895 non-null  object
 6   own_code      403895 non-null  int64
 7   occ_code      403895 non-null  object
 8   occ_title     403895 non-null  object
 9   o_group       403895 non-null  object
 10  tot_emp       403895 non-null  object
 11  emp_prse      403895 non-null  object
 12  jobs_1000     227944 non-null  object
 13  loc_quotient  227944 non-null  object
 14  pct_total     169080 non-null  object
 15  h_mean        403895 non-null  object
 16  a_mean        403895 non-null  object
 17  mean_prse     403895 non-null  object
 18  h_pct10       403895 non-null  object
 19  h_pct25       403895 non-null  object
 20  h_median      403895 non-null  object
 21  h_pct75       403895 non-null  object
 22  h_pct90       403895 non-null  object
 23  a_pct10       403895 non-null  object
 24  a_pct25       403895 non-null  object
 25  a_median      403895 non-null  object
 26  a_pct75       403895 non-null  object
 27  a_pct90       403895 non-null  object
 28  annual        15682 non-null   object
 29  hourly        729 non-null     object
 30  Unnamed: 30   0 non-null       float64
dtypes: float64(1), int64(3), object(27)
memory usage: 473.1 MB

## What the unique values can tell you

In [34]:
# the number of unique values for each column
# look closely at columns with fewer than 5 unique values
# see p. 202-203 in textbook
polls.nunique()

cycle                   1
branch                  1
type                    3
matchup                 1
forecastdate            1
state                  57
startdate             352
enddate               345
pollster              196
grade                  10
samplesize           1766
population              4
poll_wt              4399
rawpoll_clinton      1312
rawpoll_trump        1385
rawpoll_johnson       584
rawpoll_mcmullin       16
adjpoll_clinton     12569
adjpoll_trump       12582
adjpoll_johnson      6629
adjpoll_mcmullin       57
multiversions           1
url                  1304
poll_id              4208
question_id          4208
createddate           222
timestamp               3
dtype: int64

In [35]:
# see the unique values in each column
polls.apply(pd.unique)

cycle                                                          [2016]
branch                                                    [President]
type                               [polls-plus, now-cast, polls-only]
matchup                               [Clinton vs. Trump vs. Johnson]
forecastdate                                                [11/8/16]
state               [U.S., New Mexico, Virginia, Iowa, Wisconsin, ...
startdate           [11/3/2016, 11/1/2016, 11/2/2016, 11/4/2016, 1...
enddate             [11/6/2016, 11/7/2016, 11/5/2016, 11/4/2016, 1...
pollster            [ABC News/Washington Post, Google Consumer Sur...
grade                       [A+, B, A-, B-, A, nan, B+, C+, C-, C, D]
samplesize          [2220.0, 26574.0, 2195.0, 3677.0, 16639.0, 129...
population                                             [lv, rv, a, v]
poll_wt             [8.720654, 7.628472, 6.424334, 6.087135, 5.316...
rawpoll_clinton     [47.0, 38.03, 42.0, 45.0, 48.0, 44.0, 46.0, 41...
rawpoll_trump       [43.0, 35.69, 39.0, 41.0, 44.0, 40.0, 42.7, 46...
rawpoll_johnson     [4.0, 5.46, 6.0, 5.0, 3.0, 7.1, 1.0, 2.0, nan,...
rawpoll_mcmullin    [nan, 24.0, 27.6, 24.52, 25.0, 21.0, 28.0, 30....
adjpoll_clinton     [45.20163, 43.34557, 42.02638, 45.65676, 46.84...
adjpoll_trump       [41.7243, 41.21439, 38.8162, 40.92004, 42.3318...
adjpoll_johnson     [4.626221, 5.175792, 6.844734, 6.069454, 3.726...
adjpoll_mcmullin    [nan, 24.0, 27.70142, 24.13522, 24.52, 25.0, 2...
multiversions                                                [nan, *]
url                 [https://www.washingtonpost.com/news/the-fix/w...
poll_id             [48630, 48847, 48922, 48687, 48848, 48619, 485...
question_id         [76192, 76443, 76636, 76262, 76444, 76163, 760...
createddate         [11/7/16, 11/8/16, 11/6/16, 11/4/16, 11/5/16, ...
timestamp           [09:35:33  8 Nov 2016, 09:24:53  8 Nov 2016, 0...
dtype: object

## What the value counts can tell you

In [36]:
polls.state.value_counts().head(4)

U.S.              3318
Florida            444
North Carolina     375
Pennsylvania       375
Name: state, dtype: int64

In [37]:
polls.state.value_counts(normalize=True).head(4)

U.S.              0.262833
Florida           0.035171
North Carolina    0.029705
Pennsylvania      0.029705
Name: state, dtype: float64

In [38]:
polls.multiversions.value_counts(dropna=False)

NaN    12588
*         36
Name: multiversions, dtype: int64

In [39]:
polls[['state','grade']].value_counts()

state          grade
U.S.           A-       1215
               C+        546
               B         162
               C-        126
               A+        114
                        ...
Nebraska CD-1  B           3
Indiana        A           3
Nebraska CD-2  B           3
Missouri       A           3
Mississippi    C           3
Length: 321, dtype: int64

## How to drop rows

In [40]:
#polls = polls[polls.type == 'now-cast']

In [41]:
polls = polls.query('type == "now-cast"')

In [42]:
import sqlite3
fires_con = sqlite3.connect('../data/Data/FPA_FOD_20170508.sqlite')
fires = pd.read_sql_query(
    '''SELECT STATE, FIRE_YEAR, DATETIME(DISCOVERY_DATE) AS DISCOVERY_DATE,
              FIRE_NAME, FIRE_SIZE, LATITUDE, LONGITUDE
       FROM Fires''', fires_con)
fires.columns = fires.columns.str.lower()

In [43]:
fires[fires.duplicated(keep=False)]

,state,fire_year,discovery_date,fire_name,fire_size,latitude,longitude
48642,CA,1992,1992-06-28 00:00:00,None,0.1,36.021667,-118.805000
48644,CA,1992,1992-06-28 00:00:00,None,0.1,36.021667,-118.805000
71593,WA,1994,1994-08-06 00:00:00,None,0.1,46.441667,-121.783333
189841,WA,1992,1992-09-06 00:00:00,None,0.1,47.908200,-117.992700
193186,MT,1992,1992-08-14 00:00:00,None,2.0,45.083300,-107.534000
...,...,...,...,...,...,...,...
1871739,CA,2015,2015-12-20 00:00:00,DEER HOLLOW WY / PEPPERCO,0.1,33.458184,-117.086954
1871904,CA,2015,2015-12-20 00:00:00,DEER HOLLOW WY / PEPPERCO,0.1,33.458184,-117.086954
1872000,CA,2015,2015-12-20 00:00:00,DEER HOLLOW WY / PEPPERCO,0.1,33.458184,-117.086954
1876440,CA,2015,2015-05-19 00:00:00,None,1.0,34.003623,-117.167418
1878010,CA,2015,2015-05-19 00:00:00,None,1.0,34.003623,-117.167418

In [44]:
fires.drop_duplicates(keep='first', inplace=True)

## How to drop columns

In [45]:
polls.nunique()

cycle                  1
branch                 1
type                   1
matchup                1
forecastdate           1
state                 57
startdate            352
enddate              345
pollster             196
grade                 10
samplesize          1766
population             4
poll_wt             3894
rawpoll_clinton     1312
rawpoll_trump       1385
rawpoll_johnson      584
rawpoll_mcmullin      16
adjpoll_clinton     4202
adjpoll_trump       4199
adjpoll_johnson     2210
adjpoll_mcmullin      30
multiversions          1
url                 1304
poll_id             4208
question_id         4208
createddate          222
timestamp              1
dtype: int64

In [46]:
#polls = polls.drop(columns=['cycle','forecastdate'])

In [47]:
polls.drop(columns=['cycle','forecastdate'], errors='raise', inplace=True)

## How to rename columns

In [48]:
polls = polls.rename(columns={
    'rawpoll_clinton':'clinton_pct',
    'rawpoll_trump':'trump_pct'})

In [49]:
polls_names_dict = {'rawpoll_clinton':'clinton_pct',
                    'rawpoll_trump':'trump_pct'}
polls.rename(columns = polls_names_dict, inplace = True)

In [50]:
polls.columns = polls.columns.str.replace('_pct','')

In [51]:
jobs.columns = jobs.columns \
    .str.replace('^a_','annual_') \
    .str.replace('^h_','hourly_') \
    .str.replace('_pct','_percent')

<ipython-input-51-13880b04ae0c>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  jobs.columns = jobs.columns \

## How to find missing values

In [52]:
mortality_data = pd.read_csv('mortality_missing_values.csv')

In [53]:
mortality_data.head(5)

     Year     AgeGroup  DeathRate
0  1900.0  01-04 Years     1983.8
1     NaN  01-04 Years     1695.0
2  1902.0  01-04 Years        NaN
3  1903.0  01-04 Years     1542.1
4     NaN  01-04 Years        NaN

In [54]:
mortality_data.loc[5:9]

     Year     AgeGroup  DeathRate
5  1905.0  01-04 Years     1498.9
6     NaN  01-04 Years        NaN
7  1907.0  01-04 Years        NaN
8  1908.0  01-04 Years     1396.8
9  1909.0  01-04 Years     1348.9

In [55]:
missing_count = mortality_data.shape[0] - mortality_data.count()
print(missing_count)

Year         3
AgeGroup     0
DeathRate    4
dtype: int64

In [56]:
mortality_data[mortality_data.isnull().any(axis=1)]

     Year     AgeGroup  DeathRate
1     NaN  01-04 Years     1695.0
2  1902.0  01-04 Years        NaN
4     NaN  01-04 Years        NaN
6     NaN  01-04 Years        NaN
7  1907.0  01-04 Years        NaN

In [57]:
mortality_data[mortality_data.DeathRate.isnull()]

     Year     AgeGroup  DeathRate
2  1902.0  01-04 Years        NaN
4     NaN  01-04 Years        NaN
6     NaN  01-04 Years        NaN
7  1907.0  01-04 Years        NaN

In [58]:
mortality_data[mortality_data.DeathRate.notnull()]

       Year     AgeGroup  DeathRate
0    1900.0  01-04 Years     1983.8
1       NaN  01-04 Years     1695.0
3    1903.0  01-04 Years     1542.1
5    1905.0  01-04 Years     1498.9
8    1908.0  01-04 Years     1396.8
..      ...          ...        ...
471  2014.0  15-19 Years       45.5
472  2015.0  15-19 Years       48.3
473  2016.0  15-19 Years       51.2
474  2017.0  15-19 Years       51.5
475  2018.0  15-19 Years       49.2

[472 rows x 3 columns]

## How to drop rows with missing values

In [59]:
mortality_data = mortality_data.dropna()
mortality_data.head()

     Year     AgeGroup  DeathRate
0  1900.0  01-04 Years     1983.8
3  1903.0  01-04 Years     1542.1
5  1905.0  01-04 Years     1498.9
8  1908.0  01-04 Years     1396.8
9  1909.0  01-04 Years     1348.9

In [60]:
mortality_data.dropna(thresh=2, inplace=True)

In [61]:
mortality_data.dropna(subset=['DeathRate'], inplace=True)

## How to fill missing values

In [62]:
mortality_data = pd.read_csv('mortality_missing_values.csv')
mortality_data.head()

     Year     AgeGroup  DeathRate
0  1900.0  01-04 Years     1983.8
1     NaN  01-04 Years     1695.0
2  1902.0  01-04 Years        NaN
3  1903.0  01-04 Years     1542.1
4     NaN  01-04 Years        NaN

In [63]:
mortality_data.DeathRate.fillna(value=mortality_data.DeathRate.mean(), inplace=True)
mortality_data.head(4)

     Year     AgeGroup    DeathRate
0  1900.0  01-04 Years  1983.800000
1     NaN  01-04 Years  1695.000000
2  1902.0  01-04 Years   181.221186
3  1903.0  01-04 Years  1542.100000

In [64]:
mortality_data = pd.read_csv('mortality_missing_values.csv')
mortality_data.fillna(method = 'ffill', limit=2, inplace=True)
mortality_data.head(4)

     Year     AgeGroup  DeathRate
0  1900.0  01-04 Years     1983.8
1  1900.0  01-04 Years     1695.0
2  1902.0  01-04 Years     1695.0
3  1903.0  01-04 Years     1542.1

In [65]:
mortality_data = pd.read_csv('mortality_missing_values.csv')
mortality_data = mortality_data.interpolate()
mortality_data.head(4)

     Year     AgeGroup  DeathRate
0  1900.0  01-04 Years    1983.80
1  1901.0  01-04 Years    1695.00
2  1902.0  01-04 Years    1618.55
3  1903.0  01-04 Years    1542.10

## How to find date and number columns that are imported as objects

In [66]:
polls.select_dtypes('object').head(2)

,branch,type,matchup,state,startdate,enddate,pollster,grade,population,multiversions,url,createddate,timestamp
4208,President,now-cast,Clinton vs. Trump vs. Johnson,U.S.,11/3/2016,11/6/2016,ABC News/Washington Post,A+,lv,NaN,https://www.washingtonpost.com/news/the-fix/wp...,11/7/16,09:24:53 8 Nov 2016
4209,President,now-cast,Clinton vs. Trump vs. Johnson,U.S.,11/1/2016,11/7/2016,Google Consumer Surveys,B,lv,NaN,https://datastudio.google.com/u/0/#/org//repor...,11/7/16,09:24:53 8 Nov 2016

In [67]:
jobs.select_dtypes('object').head(2)

,area_title,naics,naics_title,i_group,occ_code,occ_title,o_group,tot_emp,emp_prse,jobs_1000,...,hourly_median,hourly_percent75,hourly_percent90,annual_percent10,annual_percent25,annual_median,annual_percent75,annual_percent90,annual,hourly
0,U.S.,000000,Cross-industry,cross-industry,00-0000,All Occupations,total,144733270,0.1,NaN,...,18.58,30.06,47.31,20690,25740,38640,62510,98410,NaN,NaN
1,U.S.,000000,Cross-industry,cross-industry,11-0000,Management Occupations,major,7616650,0.2,NaN,...,50.11,72.93,#,49260,70880,104240,151700,#,NaN,NaN

## How to convert date and time strings to the datetime data type

In [68]:
date_cols = ['startdate','enddate','createddate','timestamp']
polls[date_cols].head(2)

      startdate    enddate createddate             timestamp
4208  11/3/2016  11/6/2016     11/7/16  09:24:53  8 Nov 2016
4209  11/1/2016  11/7/2016     11/7/16  09:24:53  8 Nov 2016

In [69]:
polls[date_cols] = polls[date_cols].apply(pd.to_datetime)
polls[date_cols].head(2)

      startdate    enddate createddate           timestamp
4208 2016-11-03 2016-11-06  2016-11-07 2016-11-08 09:24:53
4209 2016-11-01 2016-11-07  2016-11-07 2016-11-08 09:24:53

In [70]:
polls['startdate'] = polls.startdate.dt.strftime("%m/%d/%Y")
polls['enddate'] = polls.enddate.dt.strftime("%m-%d-%y")
polls[date_cols].head(2)

       startdate   enddate createddate           timestamp
4208  11/03/2016  11-06-16  2016-11-07 2016-11-08 09:24:53
4209  11/01/2016  11-07-16  2016-11-07 2016-11-08 09:24:53

## How to convert object columns to numeric data types

In [71]:
# pd.to_numeric(jobs.tot_emp)

In [72]:
jobs.tot_emp.tail(3)

403892    170
403893    130
403894     **
Name: tot_emp, dtype: object

In [73]:
pd.to_numeric(jobs.tot_emp, errors='coerce').tail(3)

403892    170.0
403893    130.0
403894      NaN
Name: tot_emp, dtype: float64

## How to work with the category data type

In [74]:
fires.state = fires.state.astype('category')

In [75]:
statCounts = pd.read_stata('../data/GSS7218_R3.DTA', columns=['year','wrkstat'])

FileNotFoundError: [Errno 2] No such file or directory: '../../data/GSS7218_R3.DTA'

In [ ]:
filteredStatCounts = statCounts.query(
    'wrkstat in ["working fulltime","working parttime","retired"]')
filteredStatCounts.wrkstat.value_counts()

In [ ]:
# produces a warning that you'll learn about in chapter 7
filteredStatCounts['wrkstat'] = \
    filteredStatCounts.wrkstat.cat.remove_unused_categories()
filteredStatCounts.wrkstat.value_counts()

## How to replace invalid values and convert a column’s data type

In [ ]:
import numpy as np
jobs.tot_emp.replace(to_replace=['*','**'], value=[np.nan,np.nan]) # ,inplace=True)

In [ ]:
jobs.tot_emp.replace({'*':np.nan, '**':np.nan}, inplace=True)

In [ ]:
jobs.hourly_median = jobs.hourly_median.replace(to_replace='#', value = 100)

In [ ]:
jobs.hourly.replace(to_replace=np.nan, value=False, inplace=True)

## How to fix data type problems when you import the data

In [ ]:
date_cols = ['forecastdate','startdate','enddate','createddate','timestamp']

In [ ]:
polls = pd.read_csv('../../data/president_polls_2016.csv')
polls[date_cols].head(3)

In [ ]:
polls_new = pd.read_csv('../../data/president_polls_2016.csv', parse_dates=date_cols)
polls_new[date_cols].head(3)

## How to find outliers

In [ ]:
mortality_data = pd.read_pickle('mortality_cleaned.pkl')

In [ ]:
mortality_group = mortality_data.query('AgeGroup == "15-19 Years"')
mortality_group.head(3)

In [ ]:
# save DataFrame for later use
mortality_group.to_pickle('mortality_group.pkl')

In [ ]:
mortality_group.describe().T

In [ ]:
mortality_group.plot(x='Year', y='DeathRate')

In [ ]:
mortality_group.query('DeathRate > 500')

## How to fix outliers

In [ ]:
mortality_group = pd.read_pickle('mortality_group.pkl')

mortality_group = mortality_group.query('DeathRate <= 500')

In [ ]:
mortality_group = pd.read_pickle('mortality_group.pkl')

mortality_group.loc[mortality_group.DeathRate > 500, 'DeathRate'] = 450

In [ ]:
mortality_group = pd.read_pickle('mortality_group.pkl')

mortality_group.loc[mortality_group.DeathRate > 500, 'DeathRate'] \
    = mortality_group.DeathRate.mean()
mortality_group.plot(x='Year', y='DeathRate')

In [ ]:
mortality_group = pd.read_pickle('mortality_group.pkl')

mortality_group.loc[mortality_group.Year.isin([1917,1918,1919,1920]),
                    'DeathRate'] = None
mortality_group = mortality_group.interpolate()
mortality_group.plot(x='Year', y='DeathRate')